[{"Note": "The resident displayed verbally aggressive behaviour, frequently shouting and using hostile language toward staff.", "AgitationinDementia": "Verbally Aggressive Behaviour"}, {"Note": "The resident repeatedly argued with staff during care routines, refusing to cooperate.", "AgitationinDementia": "Arguing"}, {"Note": "Resident was persistently complaining about the food and room temperature throughout the day.", "AgitationinDementia": "Complaining"}, {"Note": "The resident was heard cursing loudly in response to prompts for assistance.", "AgitationinDementia": "Cursing"}, {"Note": "Resident made verbal threats to other residents during communal activities.", "AgitationinDementia": "Threat"}, {"Note": "Resident used abusive language directed at staff when asked to follow instructions.", "AgitationinDementia": "Using Abusive Language"}, {"Note": "The resident frequently accused staff of stealing her belongings without any evidence.", "AgitationinDementia": "Using Accusatory Language"}, {"Note": "Resident often used foul language during episodes of frustration and agitation.", "AgitationinDementia": "Using Foul Language"}, {"Note": "The resident spoke with hostile language when redirected from a restricted area.", "AgitationinDementia": "Using Hostile Language"}, {"Note": "Resident used obscene language repeatedly in the presence of other residents.", "AgitationinDementia": "Using Obscene Language"}, {"Note": "Resident exhibited profane language when upset about personal care assistance.", "AgitationinDementia": "Using Profane Language"}, {"Note": "Resident engaged in verbally nonaggressive behaviour by talking continuously without pause.", "AgitationinDementia": "Verbally Nonaggressive Behaviour"}, {"Note": "Ceaseless talking", "AgitationinDementia": "The Resident Was Observed Ceaselessly Talking About Unrelated Topics Throughout The Shift."}, {"Note": "Resident kept repeating the same word or phrase, showing signs of confusion.", "AgitationinDementia": "Constant Repetition Of Word"}, {"Note": "The resident made constant unwarranted requests for attention from staff during group activities.", "AgitationinDementia": "Constant Unwarranted Requests For Attention"}, {"Note": "Resident repeatedly asked for help despite being capable of completing tasks independently.", "AgitationinDementia": "Constant Unwarranted Requests For Help"}, {"Note": "Resident sought constant unwarranted reassurance about her safety and well-being.", "AgitationinDementia": "Constant Unwarranted Requests For Reassurance"}, {"Note": "Resident was heard groaning intermittently during rest periods.", "AgitationinDementia": "Echolalia"}, {"Note": "Resident displayed grunting sounds, especially when frustrated.", "AgitationinDementia": "Grunting"}, {"Note": "The resident emitted howling noises during periods of distress.", "AgitationinDementia": "Howling"}, {"Note": "Resident made bizarre noises that were difficult to interpret.", "AgitationinDementia": "Making Bizarre Noise"}, {"Note": "Resident spoke in a rambling manner without clear topic or direction.", "AgitationinDementia": "Repetitive Questioning"}, {"Note": "Resident repeatedly asked the same questions despite receiving answers.", "AgitationinDementia": "Repeate"}, {"Note": "Resident roared loudly during episodes of agitation.", "AgitationinDementia": "Roaring"}, {"Note": "The resident was screaming loudly during personal care activities.", "AgitationinDementia": "Screaming"}, {"Note": "Resident shouted at staff when feeling overwhelmed or upset.", "AgitationinDementia": "Shouting"}, {"Note": "Resident spoke in an excessively loud voice, causing disturbance to others.", "AgitationinDementia": "Speaking In Excessively Loud Voice"}, {"Note": "Resident showed signs of emotional distress, including tearfulness and agitation.", "AgitationinDementia": "Emotional Distress"}, {"Note": "Resident displayed anger when denied access to restricted areas.", "AgitationinDementia": "Anger"}, {"Note": "Resident showed frustration when unable to communicate needs effectively.", "AgitationinDementia": "Frustration"}, {"Note": "Resident appeared irritable, reacting sharply to minor disruptions.", "AgitationinDementia": "Irritability"}, {"Note": "Resident experienced rapid mood swings from calm to agitated states.", "AgitationinDementia": "Mood Swing"}, {"Note": "Resident demonstrated negativism by refusing all assistance and care.", "AgitationinDementia": "Negativism"}, {"Note": "Resident had sudden outbursts of yelling and throwing objects.", "AgitationinDementia": "Outburst"}, {"Note": "Resident exhibited physically aggressive behaviour by hitting and pushing staff.", "AgitationinDementia": "Physically Aggressive Behaviour"}, {"Note": "Resident bit staff during attempts to assist with hygiene.", "AgitationinDementia": "Biting"}, {"Note": "Resident destroyed personal belongings in moments of agitation.", "AgitationinDementia": "Destroying Property"}, {"Note": "Resident was involved in a physical fight with another resident.", "AgitationinDementia": "Fighting"}, {"Note": "Resident grabbed at staff forcefully when resisting care.", "AgitationinDementia": "Grabbing"}, {"Note": "Resident hit staff multiple times during morning care.", "AgitationinDementia": "Hitting"}, {"Note": "Resident was observed hurting herself by scratching her arms.", "AgitationinDementia": "Hurting Self"}, {"Note": "Resident attempted to hurt another resident during communal time.", "AgitationinDementia": "Hurting Someone"}, {"Note": "Resident kicked at staff when assistance was provided.", "AgitationinDementia": "Kicking"}, {"Note": "Resident pushed staff away during dressing assistance.", "AgitationinDementia": "Pushing"}, {"Note": "Resident was resisting care and physically pulling away.", "AgitationinDementia": "Resisting"}, {"Note": "Resident scratched staff when they tried to help with toileting.", "AgitationinDementia": "Scratching"}, {"Note": "Resident shoved staff in an attempt to move past them.", "AgitationinDementia": "Shoving"}, {"Note": "Resident slammed doors loudly during episodes of frustration.", "AgitationinDementia": "Slamming"}, {"Note": "Resident spat on staff during an agitation episode.", "AgitationinDementia": "Spitting On People"}, {"Note": "Resident was observed staring blankly at the wall for extended periods.", "AgitationinDementia": "Staring"}, {"Note": "Resident struck staff during morning care routines.", "AgitationinDementia": "Striking People"}, {"Note": "Resident threw objects at staff when upset.", "AgitationinDementia": "Throwing Object"}, {"Note": "Resident displayed physically nonaggressive behaviour such as pacing and fidgeting.", "AgitationinDementia": "Physically Nonaggressive Behaviour"}, {"Note": "Resident constantly manipulated and fiddled with a small toy.", "AgitationinDementia": "Constant Manipulation Of Object"}, {"Note": "Resident showed fidgeting behaviour, repeatedly tapping fingers on the table.", "AgitationinDementia": "Fidgeting"}, {"Note": "Resident’s loud yelling frightened other residents.", "AgitationinDementia": "Frightening Others"}, {"Note": "Resident made inappropriate hand gestures toward staff.", "AgitationinDementia": "Gesturing"}, {"Note": "Resident was seen wringing her hands anxiously.", "AgitationinDementia": "Hand Wringing"}, {"Note": "Resident wore inappropriate clothing for the weather conditions.", "AgitationinDementia": "Inappropriate Dressing"}, {"Note": "Resident handled objects inappropriately, throwing utensils during meals.", "AgitationinDementia": "Inappropriate Handling Object"}, {"Note": "Resident undressed in public areas without awareness of social norms.", "AgitationinDementia": "Inappropriate Undressing"}, {"Note": "Resident paced the hallway continuously throughout the shift.", "AgitationinDementia": "Pacing"}, {"Note": "Resident pointed fingers accusingly at other residents.", "AgitationinDementia": "Pointing Finger"}, {"Note": "The resident lacks insight into her care needs and personal safety and refuses care most of the time.", "AgitationinDementia": "Resistive"}, {"Note": "The Resident repeatedly argued with peers during group activities.", "AgitationinDementia": "Argue"}, {"Note": "The resident hoarded multiple items in their bedside drawer.", "AgitationinDementia": "Hoarding Items"}, {"Note": "Resident required full assistance with all her ADL's activities due to her Dementia ,has no understanding about all her needs ,can be anxious and agitated at time responding with much TLC & reassurance", "AgitationinDementia": "Anxiety, Agitation"}, {"Note": "resident lacks insight into his personal hygiene needs and is unable to initiate tasks or do them in sequence  resident can get refuse assistance and get physically aggressive at times.", "AgitationinDementia": "Refusal Of Care, Physical Aggression"}, {"Note": "Resident may be physically aggressive at times when agitated and has communication impairment due to dementia.", "AgitationinDementia": "Physical Aggressive, Communication Impairment"}, {"Note": "Resident also requires assistance due to agitation and aggressive behaviour at times, and can be resistive to care due to his advancing dementia.", "AgitationinDementia": "Agitation, Aggressive Behaviour, Refusal Of Care"}, {"Note": "Staff assist resident with his meals if he allows them to,  he can become aggressive at time so staff need to leave him and supervise from a distance and try again at another time.", "AgitationinDementia": "Aggressive Behaviour"}, {"Note": " resident constantly wanders to the other levels and asks about her family and home due to her Dementia. ", "AgitationinDementia": "Wander, Ask About Her Family And Home,"}, {"Note": "she also  has a history of absconding multiple times, due to which staff to regularly monitor her location and redirect her.", "AgitationinDementia": "Ascond"}, {"Note": "Due to resident Dementia she is disorientated.", "AgitationinDementia": "Disorientated"}, {"Note": "resident can often display behaviours such as agitation, frustration fiddling and restlessness due to her resident's dementia diagnosis. resident's communication Is also limited due to her dementia diagnosis. ", "AgitationinDementia": "Agittion, Frustration, Fiddling, Restlessness, Limited Communication"}, {"Note": "resident was very aggressive towards staff when they were trying to attend to her personal hygiene after lunch as she was incontinent of faeces. ", "AgitationinDementia": "Aggressive "}, {"Note": "It took three staff to attend to her as she was verbally and physically aggressive. ", "AgitationinDementia": "Verbal Aggression, Physical Aggression"}, {"Note": "resident was using very inappropriate language and trying to pinch and scratch staff. ", "AgitationinDementia": "Use Inappropriate Language, Pinch,  Scratch "}]