[{"Note": "Resident ate well at dinner and enjoyed the company of another female resident. the night went on became a little anxious.", "Malnutrition Risk Factors": "Anxiety"}, {"Note": "Resident settled better this pm, and weight attended. Wound care attended. administered as per discharge summary.", "Malnutrition Risk Factors": "Wound"}, {"Note": "Confused losing glasses. on buttock unbroken. MP was given documentation that was scanned in yesterday.", "Malnutrition Risk Factors": "Confusion"}, {"Note": "Visited by daughter who gave staff report from clinical nurse consultant in dementia, scanned and attached.", "Malnutrition Risk Factors": "Dementia"}, {"Note": "Denies pain when asked this morning. Requires frequent toileting, often attempts to self toilet. Accepting of staff administration of medication. Visited by daughter this morning. Receiving daily wound care for stage 1 pressure area to buttocks..", "Malnutrition Risk Factors": "Pressure Ulcer"}, {"Note": "Resident is eating and drinking well. Resident takes all medications as per chart. BGL 9.3mmol/L at 1700hrs. ", "Malnutrition Risk Factors": "Blood Glucose"}, {"Note": "Resident refused to let staff assist him in cares stated he can do himself, staff explained that we are here to assist him and he still refused. ", "Malnutrition Risk Factors": "Refusal Of Care"}, {"Note": "Resident's ADL (e.g. Eating, Drinking, Mobility, Transfer, Personal Hygiene, Toileting & Continence) has thicken level 1 fluids. ", "Malnutrition Risk Factors": "Fluid Modification"}, {"Note": "Resident's ADL (e.g. Eating, Drinking, Mobility, Transfer, Personal Hygiene, Toileting & Continence) has soft moist diet.", "Malnutrition Risk Factors": "Food Modification"}, {"Note": "Requires frequent toileting, often attempts to self toilet - monitor with falls risk.", "Malnutrition Risk Factors": "Fall"}, {"Note": "I have discussed with his hosp spec physician -confirms the over riding dx of widespread metastatic prostate ca, recent PEs, background psychosis", "Malnutrition Risk Factors": "Cancer"}, {"Note": "Resident has a history of bowel blockage and requires ongoing monitoring of bowel movements.", "Malnutrition Risk Factors": "Bowel Blockage"}, {"Note": "Resident is recovering from a recent chest infection, which has affected her appetite and energy levels.", "Malnutrition Risk Factors": "Chest Infection"}, {"Note": "Resident has chronic constipation and is currently on a bowel management plan.", "Malnutrition Risk Factors": "Constipation"}, {"Note": "Resident experienced delirium during the night, showing signs of confusion and reduced oral intake.", "Malnutrition Risk Factors": "Delirium"}, {"Note": "Resident diagnosed with depression and often refuses meals or eats very little.", "Malnutrition Risk Factors": "Depression"}, {"Note": "Resident has diabetes and is on a controlled diet with regular blood sugar monitoring.", "Malnutrition Risk Factors": "Diabetes"}, {"Note": "Resident has had ongoing episodes of diarrhea, impacting nutritional absorption.", "Malnutrition Risk Factors": "Diarrhea"}, {"Note": "Resident experiences difficulty swallowing and requires assistance during mealtimes.", "Malnutrition Risk Factors": "Difficulty Swallowing"}, {"Note": "Resident diagnosed with dysphagia; meals provided with texture-modified diet and thickened fluids.", "Malnutrition Risk Factors": "Dysphagia"}, {"Note": "Resident presents with a history of eating disorder and continues to show restrictive eating behaviours.", "Malnutrition Risk Factors": "Eating Disorder"}, {"Note": "Resident has strong food preferences and often refuses meals that do not meet her expectations.", "Malnutrition Risk Factors": "Food Preference"}, {"Note": "Resident reports symptoms of gastritis and has reduced oral intake due to abdominal discomfort.", "Malnutrition Risk Factors": "Gastritis"}, {"Note": "Resident has a history of heart disease and is on a salt-restricted cardiac diet.", "Malnutrition Risk Factors": "Heart Disease"}, {"Note": "Resident recently returned from hospital admission with decreased appetite and weakness.", "Malnutrition Risk Factors": "Hospital Admission"}, {"Note": "Resident is socially isolated and often eats alone, which has impacted her overall intake.", "Malnutrition Risk Factors": "Isolation"}, {"Note": "Resident has been experiencing nausea which is affecting her meal consumption.", "Malnutrition Risk Factors": "Nausea"}, {"Note": "Resident with Parkinson’s disease has tremors affecting self-feeding and requires supervision.", "Malnutrition Risk Factors": "Parkinson"}, {"Note": "Resident is recovering from pneumonia, leading to fatigue and poor oral intake.", "Malnutrition Risk Factors": "Pneumonia"}, {"Note": "Resident has a consistently poor appetite and consumes less than 50% of meals.", "Malnutrition Risk Factors": "Poor Appetite"}, {"Note": "Resident had a recent stroke and now requires assistance with feeding and swallowing.", "Malnutrition Risk Factors": "Stroke"}, {"Note": "Resident recently underwent surgery and has been slow to resume normal eating.", "Malnutrition Risk Factors": "Surgery"}, {"Note": "Resident has had multiple episodes of vomiting, contributing to poor nutritional status.", "Malnutrition Risk Factors": "Vomiting"}]